OpenNuvoton/NuTool-PinConfigure/Header/NANO103/sys.h
/**************************************************************************//**
* @file     sys.h
* @version  V1.00
* $Revision: 17 $
* $Date: 16/03/30 1:41p $
* @brief    NANO103 Series system control header file.
*
* @note
* Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#ifndef __SYS_H__
#define __SYS_H__

#ifdef __cplusplus
extern "C"
{
#endif

/** @addtogroup NANO103_Device_Driver NANO103 Device Driver
  @{
*/

/** @addtogroup NANO103_SYS_Driver SYS Driver
  @{
*/

/** @addtogroup NANO103_SYS_EXPORTED_CONSTANTS SYS Exported Constants
  @{
*/

/*---------------------------------------------------------------------------------------------------------*/
/*  Module Reset Control Resister constant definitions.                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define CHIP_RST  ((0x0<<24) | SYS_IPRST1_CHIPRST_Pos  ) /*!< CPU reset is one of the SYS_ResetModule parameter */
#define CPU_RST   ((0x0<<24) | SYS_IPRST1_CPURST_Pos   ) /*!< CHIP reset is one of the SYS_ResetModule parameter */
#define DMA_RST   ((0x0<<24) | SYS_IPRST1_PDMARST_Pos  ) /*!< DMA reset is one of the SYS_ResetModule parameter */
#define SC1_RST   ((0x4<<24) | SYS_IPRST2_SC1RST_Pos   ) /*!< SmartCard1 reset is one of the SYS_ResetModule parameter */
#define SC0_RST   ((0x4<<24) | SYS_IPRST2_SC0RST_Pos   ) /*!< SmartCard0 reset is one of the SYS_ResetModule parameter */
#define ADC_RST   ((0x4<<24) | SYS_IPRST2_ADCRST_Pos   ) /*!< ADC reset is one of the SYS_ResetModule parameter */
#define ACMP0_RST ((0x4<<24) | SYS_IPRST2_ACMP0RST_Pos ) /*!< ACMP0 reset is one of the SYS_ResetModule parameter */
#define PWM0_RST  ((0x4<<24) | SYS_IPRST2_PWM0RST_Pos  ) /*!< PWM0 reset is one of the SYS_ResetModule parameter */
#define UART1_RST ((0x4<<24) | SYS_IPRST2_UART1RST_Pos ) /*!< UART1 reset is one of the SYS_ResetModule parameter */
#define UART0_RST ((0x4<<24) | SYS_IPRST2_UART0RST_Pos ) /*!< UART0 reset is one of the SYS_ResetModule parameter */
#define SPI3_RST  ((0x4<<24) | SYS_IPRST2_SPI3RST_Pos  ) /*!< SPI3 reset is one of the SYS_ResetModule parameter */
#define SPI2_RST  ((0x4<<24) | SYS_IPRST2_SPI2RST_Pos  ) /*!< SPI2 reset is one of the SYS_ResetModule parameter */
#define SPI1_RST  ((0x4<<24) | SYS_IPRST2_SPI1RST_Pos  ) /*!< SPI1 reset is one of the SYS_ResetModule parameter */
#define SPI0_RST  ((0x4<<24) | SYS_IPRST2_SPI0RST_Pos  ) /*!< SPI0 reset is one of the SYS_ResetModule parameter */
#define I2C1_RST  ((0x4<<24) | SYS_IPRST2_I2C1RST_Pos  ) /*!< I2C1 reset is one of the SYS_ResetModule parameter */
#define I2C0_RST  ((0x4<<24) | SYS_IPRST2_I2C0RST_Pos  ) /*!< I2C0 reset is one of the SYS_ResetModule parameter */
#define TMR3_RST  ((0x4<<24) | SYS_IPRST2_TMR3RST_Pos  ) /*!< Timer3 reset is one of the SYS_ResetModule parameter */
#define TMR2_RST  ((0x4<<24) | SYS_IPRST2_TMR2RST_Pos  ) /*!< Timer2 reset is one of the SYS_ResetModule parameter */
#define TMR1_RST  ((0x4<<24) | SYS_IPRST2_TMR1RST_Pos  ) /*!< Timer1 reset is one of the SYS_ResetModule parameter */
#define TMR0_RST  ((0x4<<24) | SYS_IPRST2_TMR0RST_Pos  ) /*!< Timer0 reset is one of the SYS_ResetModule parameter */
#define GPIO_RST  ((0x4<<24) | SYS_IPRST2_GPIORST_Pos  ) /*!< GPIO reset is one of the SYS_ResetModule parameter */

/*---------------------------------------------------------------------------------------------------------*/
/*  Multi-Function constant definitions.                                                                   */
/*---------------------------------------------------------------------------------------------------------*/


/********************** Brown Out Detector Threshold Voltage Selection constant definitions **********************/
#define SYS_BODCTL_BOD_RST_EN           (1UL<<SYS_BODCTL_BODREN_Pos)        /*!< Brown-out Reset Enable */
#define SYS_BODCTL_BOD_INTERRUPT_EN     (1UL<<SYS_BODCTL_BODIE_Pos)         /*!< Brown-out Interrupt Enable */
#define SYS_BODCTL_BODVL_1_7V           (0UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 1.7V */
#define SYS_BODCTL_BODVL_1_8V           (1UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 1.8V */
#define SYS_BODCTL_BODVL_1_9V           (2UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 1.9V */
#define SYS_BODCTL_BODVL_2_0V           (3UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 2.0V */
#define SYS_BODCTL_BODVL_2_1V           (4UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 2.1V */
#define SYS_BODCTL_BODVL_2_2V           (5UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 2.2V */
#define SYS_BODCTL_BODVL_2_3V           (6UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 2.3V */
#define SYS_BODCTL_BODVL_2_4V           (7UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 2.4V */
#define SYS_BODCTL_BODVL_2_5V           (8UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 2.5V */
#define SYS_BODCTL_BODVL_2_6V           (9UL<<SYS_BODCTL_BODVL_Pos)       /*!< Setting Brown Out Detector Threshold Voltage as 2.6V */
#define SYS_BODCTL_BODVL_2_7V           (0xAUL<<SYS_BODCTL_BODVL_Pos)     /*!< Setting Brown Out Detector Threshold Voltage as 2.7V */
#define SYS_BODCTL_BODVL_2_8V           (0xBUL<<SYS_BODCTL_BODVL_Pos)     /*!< Setting Brown Out Detector Threshold Voltage as 2.8V */
#define SYS_BODCTL_BODVL_2_9V           (0xCUL<<SYS_BODCTL_BODVL_Pos)     /*!< Setting Brown Out Detector Threshold Voltage as 2.9V */
#define SYS_BODCTL_BODVL_3_0V           (0xDUL<<SYS_BODCTL_BODVL_Pos)     /*!< Setting Brown Out Detector Threshold Voltage as 3.0V */
#define SYS_BODCTL_BODVL_3_1V           (0xEUL<<SYS_BODCTL_BODVL_Pos)     /*!< Setting Brown Out Detector Threshold Voltage as 3.1V */

/********************** Low Power Brown Out Detector Threshold Voltage Selection constant definitions **********************/
#define SYS_BODCTL_LPBOD_RST_EN           (1UL<<SYS_BODCTL_LPBODREN_Pos)        /*!< Low Power Brown-out Reset Enable */
#define SYS_BODCTL_LPBOD_INTERRUPT_EN     (1UL<<SYS_BODCTL_LPBODIE_Pos)         /*!< Low Power Brown-out Interrupt Enable */
#define SYS_BODCTL_LPBODVL_2_0V           (0UL<<SYS_BODCTL_LPBODVL_Pos)       /*!< Setting Low Power Brown Out Detector Threshold Voltage as 2.0V */
#define SYS_BODCTL_LPBODVL_2_5V           (1UL<<SYS_BODCTL_LPBODVL_Pos)       /*!< Setting Low Power Brown Out Detector Threshold Voltage as 2.5V */

/********************* Bit definition of IVREFCTL register **********************/
#define SYS_IVREFCTL_BGP_EN      ((uint32_t)0x00000001)      /*!<Band-gap Enable */
#define SYS_IVREFCTL_REG_EN      ((uint32_t)0x00000002)      /*!<Regulator Enable */
#define SYS_IVREFCTL_SEL25       ((uint32_t)0x00000008)      /*!<Regulator Output Voltage 2.5V */
#define SYS_IVREFCTL_SEL18       ((uint32_t)0x00000004)      /*!<Regulator Output Voltage 1.8V */
#define SYS_IVREFCTL_SEL15       ((uint32_t)0x00000000)      /*!<Regulator Output Voltage 1.5V */
#define SYS_IVREFCTL_EXTMODE     ((uint32_t)0x00000010)      /*!<Regulator External Mode */


/********************* Bit definition of LDOCTL register **********************/
#define SYS_LDOCTL_LDO_LEVEL12  ((uint32_t)0x00000000)      /*!< LDO  Output 1.2  Voltage  */
#define SYS_LDOCTL_LDO_LEVEL16  ((uint32_t)0x00000004)      /*!< LDO  Output 1.6  Voltage  */
#define SYS_LDOCTL_LDO_LEVEL18  ((uint32_t)0x00000008)      /*!< LDO  Output 1.8  Voltage  */


/********************* Bit definition of IRC0TCTL/IRC1TCTL/MIRCTCTL register **********************/
#define SYS_IRC0TCTL_TRIM_11_0592M ((uint32_t)0x00000001)      /*!<Trim IRC to 11.0592 MHz */
#define SYS_IRC0TCTL_TRIM_12M      ((uint32_t)0x00000002)      /*!<Trim IRC to 12 MHz */
#define SYS_IRC0TCTL_TRIM_12_288M  ((uint32_t)0x00000003)      /*!<Trim IRC to 12.288 MHz */
#define SYS_IRC0TCTL_TRIM_16M      ((uint32_t)0x00000004)      /*!<Trim IRC to 16 MHz */

#define SYS_IRC1TCTL_TRIM_36M      ((uint32_t)0x00000002)      /*!<Trim IRC to 36 MHz */
#define SYS_MIRCTCTL_TRIM_4M       ((uint32_t)0x00000002)      /*!<Trim IRC to 4 MHz */

#define SYS_IRCTCTL_LOOP_4CLK      ((uint32_t)0x00000000)      /*!<Based on average difference in 4 x 32.768 kHz clock */
#define SYS_IRCTCTL_LOOP_8CLK      ((uint32_t)0x00000010)      /*!<Based on average difference in 8 x 32.768 kHz clock */
#define SYS_IRCTCTL_LOOP_16CLK     ((uint32_t)0x00000020)      /*!<Based on average difference in 16 x 32.768 kHz clock */
#define SYS_IRCTCTL_LOOP_32CLK     ((uint32_t)0x00000030)      /*!<Based on average difference in 32 x 32.768 kHz clock */

#define SYS_IRCTCTL_RETRY_64       ((uint32_t)0x00000000)      /*!<Trim retry count limitation is 64 */
#define SYS_IRCTCTL_RETRY_128      ((uint32_t)0x00000040)      /*!<Trim retry count limitation is 128 */
#define SYS_IRCTCTL_RETRY_256      ((uint32_t)0x00000080)      /*!<Trim retry count limitation is 256 */
#define SYS_IRCTCTL_RETRY_512      ((uint32_t)0x000000C0)      /*!<Trim retry count limitation is 512 */

