OpenNuvoton/NuTool-PinConfigure/Header/NANO103/sys.h
#define SYS_IRCTCTL_CLKERR_STOP    ((uint32_t)0x00000100)      /*!<Clock error stop enable */

/********************* Bit definition of IRC0TIEN/IRC1TIEN/MIRCTIEN register **********************/
#define SYS_IRCTIEN_DISABLE      ((uint32_t)0x00000000)      /*!<Trim failure interrupt disable */
#define SYS_IRCTIEN_FAIL_EN      ((uint32_t)0x00000002)      /*!<Trim failure interrupt enable */
#define SYS_IRCTIEN_32KERR_EN    ((uint32_t)0x00000004)      /*!<32.768 kHz Clock Error Interrupt Enable */

/********************* Bit definition of IRC0TISTS/IRC1TISTS/MIRCTISTS register **********************/
#define SYS_IRCTISTS_FREQLOCK     ((uint32_t)0x00000001)      /*!<HIRC frequency lock status */
#define SYS_IRCTISTS_FAIL_INT     ((uint32_t)0x00000002)      /*!<Trim failure interrupt status */
#define SYS_IRCTISTS_32KERR_INT   ((uint32_t)0x00000004)      /*!<32.768 kHz Clock Error Interrupt Status */

/********************* Bit definition of GPA_MFPL register **********************/
#define SYS_GPA_MFPL_PA0MFP_GPIO              (0x00UL<<SYS_GPA_MFPL_PA0MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPL_PA0MFP_ADC_CH0           (0x01UL<<SYS_GPA_MFPL_PA0MFP_Pos) /*!< ADC channel0 analog input. */
#define SYS_GPA_MFPL_PA0MFP_ACMP0_P           (0x02UL<<SYS_GPA_MFPL_PA0MFP_Pos) /*!< Analog comparator0 positive input pin. */
#define SYS_GPA_MFPL_PA0MFP_TM2_EXT           (0x03UL<<SYS_GPA_MFPL_PA0MFP_Pos) /*!< Timer2 external capture input. */
#define SYS_GPA_MFPL_PA0MFP_PWM0_CH2          (0x05UL<<SYS_GPA_MFPL_PA0MFP_Pos) /*!< PWM0 channel2 output/capture input. */
#define SYS_GPA_MFPL_PA0MFP_SPI3_MOSI1        (0x06UL<<SYS_GPA_MFPL_PA0MFP_Pos) /*!< 2nd SPI3 MOSI (Master Out, Slave In) pin. */
#define SYS_GPA_MFPL_PA1MFP_GPIO              (0x00UL<<SYS_GPA_MFPL_PA1MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPL_PA1MFP_ADC_CH1           (0x01UL<<SYS_GPA_MFPL_PA1MFP_Pos) /*!< ADC channel1 analog input. */
#define SYS_GPA_MFPL_PA1MFP_ACMP0_N           (0x02UL<<SYS_GPA_MFPL_PA1MFP_Pos) /*!< Analog comparator0 negative input pin. */
#define SYS_GPA_MFPL_PA1MFP_SPI3_MISO1        (0x06UL<<SYS_GPA_MFPL_PA1MFP_Pos) /*!< 2nd SPI3 MISO (Master In, Slave Out) pin. */
#define SYS_GPA_MFPL_PA2MFP_GPIO              (0x00UL<<SYS_GPA_MFPL_PA2MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPL_PA2MFP_ADC_CH2           (0x01UL<<SYS_GPA_MFPL_PA2MFP_Pos) /*!< ADC channel2 analog input. */
#define SYS_GPA_MFPL_PA2MFP_UART1_RXD         (0x05UL<<SYS_GPA_MFPL_PA2MFP_Pos) /*!< Data receiver input pin for UART1. */
#define SYS_GPA_MFPL_PA3MFP_GPIO              (0x00UL<<SYS_GPA_MFPL_PA3MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPL_PA3MFP_ADC_CH3           (0x01UL<<SYS_GPA_MFPL_PA3MFP_Pos) /*!< ADC channel3 analog input. */
#define SYS_GPA_MFPL_PA3MFP_UART1_TXD         (0x05UL<<SYS_GPA_MFPL_PA3MFP_Pos) /*!< Data transmitter output pin for UART1. */
#define SYS_GPA_MFPL_PA3MFP_SPI3_MOSI0        (0x06UL<<SYS_GPA_MFPL_PA3MFP_Pos) /*!< 1st SPI3 MOSI (Master Out, Slave In) pin. */
#define SYS_GPA_MFPL_PA4MFP_GPIO              (0x00UL<<SYS_GPA_MFPL_PA4MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPL_PA4MFP_ADC_CH4           (0x01UL<<SYS_GPA_MFPL_PA4MFP_Pos) /*!< ADC channel4 analog input. */
#define SYS_GPA_MFPL_PA4MFP_I2C0_SDA          (0x05UL<<SYS_GPA_MFPL_PA4MFP_Pos) /*!< I2C0 data input/output pin. */
#define SYS_GPA_MFPL_PA4MFP_SPI3_MISO0        (0x06UL<<SYS_GPA_MFPL_PA4MFP_Pos) /*!< 1st SPI3 MISO (Master In, Slave Out) pin. */
#define SYS_GPA_MFPL_PA5MFP_GPIO              (0x00UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPL_PA5MFP_ADC_CH5           (0x01UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< ADC channel5 analog input. */
#define SYS_GPA_MFPL_PA5MFP_I2C0_SCL          (0x05UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< I2C0 clock pin. */
#define SYS_GPA_MFPL_PA5MFP_SPI3_CLK          (0x06UL<<SYS_GPA_MFPL_PA5MFP_Pos) /*!< SPI3 serial clock pin. */
#define SYS_GPA_MFPL_PA6MFP_GPIO              (0x00UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPL_PA6MFP_ADC_CH6           (0x01UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< ADC channel6 analog input. */
#define SYS_GPA_MFPL_PA6MFP_ACMP0_O           (0x02UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< Analog comparator0 output. */
#define SYS_GPA_MFPL_PA6MFP_TM3_EXT           (0x03UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< Timer3 external capture input. */
#define SYS_GPA_MFPL_PA6MFP_TM3_CNT           (0x04UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< Timer3 event counter input. */
#define SYS_GPA_MFPL_PA6MFP_PWM0_CH3          (0x05UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< PWM0 channel3 output/capture input. */
#define SYS_GPA_MFPL_PA6MFP_SPI3_SS0          (0x06UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< 1st SPI3 slave select pin. */
#define SYS_GPA_MFPL_PA6MFP_TM3_OUT           (0x07UL<<SYS_GPA_MFPL_PA6MFP_Pos) /*!< Timer3 toggle output. */
/********************* Bit definition of GPA_MFPH register **********************/
#define SYS_GPA_MFPH_PA8MFP_GPIO              (0x00UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPH_PA8MFP_I2C0_SDA          (0x01UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< I2C0 data input/output pin. */
#define SYS_GPA_MFPH_PA8MFP_TM0_CNT           (0x02UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< Timer0 event counter input. */
#define SYS_GPA_MFPH_PA8MFP_SC0_CLK           (0x03UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< SmartCard0 clock pin. */
#define SYS_GPA_MFPH_PA8MFP_SPI2_SS0          (0x04UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< 1st SPI2 slave select pin. */
#define SYS_GPA_MFPH_PA8MFP_TM0_OUT           (0x05UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< Timer0 toggle output. */
#define SYS_GPA_MFPH_PA8MFP_UART1_nCTS        (0x06UL<<SYS_GPA_MFPH_PA8MFP_Pos) /*!< Clear to Send input pin for UART1. */
#define SYS_GPA_MFPH_PA9MFP_GPIO              (0x00UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPH_PA9MFP_I2C0_SCL          (0x01UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< I2C0 clock pin. */
#define SYS_GPA_MFPH_PA9MFP_TM1_CNT           (0x02UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< Timer1 event counter input. */
#define SYS_GPA_MFPH_PA9MFP_SC0_DAT           (0x03UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< SmartCard0 data pin. */
#define SYS_GPA_MFPH_PA9MFP_SPI2_CLK          (0x04UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< SPI2 serial clock pin. */
#define SYS_GPA_MFPH_PA9MFP_TM1_OUT           (0x05UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< Timer1 toggle output. */
#define SYS_GPA_MFPH_PA9MFP_UART1_nRTS        (0x06UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< Request to Send output pin for UART1. */
#define SYS_GPA_MFPH_PA9MFP_SNOOPER           (0x07UL<<SYS_GPA_MFPH_PA9MFP_Pos) /*!< Snooper pin. */
#define SYS_GPA_MFPH_PA10MFP_GPIO             (0x00UL<<SYS_GPA_MFPH_PA10MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPH_PA10MFP_I2C1_SDA         (0x01UL<<SYS_GPA_MFPH_PA10MFP_Pos) /*!< I2C1 data input/output pin. */
#define SYS_GPA_MFPH_PA10MFP_TM2_CNT          (0x02UL<<SYS_GPA_MFPH_PA10MFP_Pos) /*!< Timer2 event counter input. */
#define SYS_GPA_MFPH_PA10MFP_SC0_PWR          (0x03UL<<SYS_GPA_MFPH_PA10MFP_Pos) /*!< SmartCard0 power pin. */
#define SYS_GPA_MFPH_PA10MFP_SPI2_MISO0       (0x04UL<<SYS_GPA_MFPH_PA10MFP_Pos) /*!< 1st SPI2 MISO (Master In, Slave Out) pin. */
#define SYS_GPA_MFPH_PA10MFP_TM2_OUT          (0x05UL<<SYS_GPA_MFPH_PA10MFP_Pos) /*!< Timer2 toggle output. */
#define SYS_GPA_MFPH_PA11MFP_GPIO             (0x00UL<<SYS_GPA_MFPH_PA11MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPH_PA11MFP_I2C1_SCL         (0x01UL<<SYS_GPA_MFPH_PA11MFP_Pos) /*!< I2C1 clock pin. */
#define SYS_GPA_MFPH_PA11MFP_TM3_CNT          (0x02UL<<SYS_GPA_MFPH_PA11MFP_Pos) /*!< Timer3 event counter input. */
#define SYS_GPA_MFPH_PA11MFP_SC0_RST          (0x03UL<<SYS_GPA_MFPH_PA11MFP_Pos) /*!< SmartCard0 reset pin. */
#define SYS_GPA_MFPH_PA11MFP_SPI2_MOSI0       (0x04UL<<SYS_GPA_MFPH_PA11MFP_Pos) /*!< 1st SPI2 MOSI (Master Out, Slave In) pin. */
#define SYS_GPA_MFPH_PA11MFP_TM3_OUT          (0x05UL<<SYS_GPA_MFPH_PA11MFP_Pos) /*!< Timer3 toggle output. */
#define SYS_GPA_MFPH_PA12MFP_GPIO             (0x00UL<<SYS_GPA_MFPH_PA12MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPH_PA12MFP_PWM0_CH0         (0x01UL<<SYS_GPA_MFPH_PA12MFP_Pos) /*!< PWM0 channel0 output/capture input. */
#define SYS_GPA_MFPH_PA12MFP_TM0_EXT          (0x03UL<<SYS_GPA_MFPH_PA12MFP_Pos) /*!< Timer0 external capture input. */
#define SYS_GPA_MFPH_PA12MFP_I2C0_SDA         (0x05UL<<SYS_GPA_MFPH_PA12MFP_Pos) /*!< I2C0 data input/output pin. */
#define SYS_GPA_MFPH_PA13MFP_GPIO             (0x00UL<<SYS_GPA_MFPH_PA13MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPH_PA13MFP_PWM0_CH1         (0x01UL<<SYS_GPA_MFPH_PA13MFP_Pos) /*!< PWM0 channel1 output/capture input. */
#define SYS_GPA_MFPH_PA13MFP_TM1_EXT          (0x03UL<<SYS_GPA_MFPH_PA13MFP_Pos) /*!< Timer1 external capture input. */
#define SYS_GPA_MFPH_PA13MFP_I2C0_SCL         (0x05UL<<SYS_GPA_MFPH_PA13MFP_Pos) /*!< I2C0 clock pin. */
#define SYS_GPA_MFPH_PA14MFP_GPIO             (0x00UL<<SYS_GPA_MFPH_PA14MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPH_PA14MFP_PWM0_CH2         (0x01UL<<SYS_GPA_MFPH_PA14MFP_Pos) /*!< PWM0 channel2 output/capture input. */
#define SYS_GPA_MFPH_PA14MFP_I2C1_SDA         (0x02UL<<SYS_GPA_MFPH_PA14MFP_Pos) /*!< I2C1 data input/output pin. */
#define SYS_GPA_MFPH_PA14MFP_TM2_EXT          (0x03UL<<SYS_GPA_MFPH_PA14MFP_Pos) /*!< Timer2 external capture input. */
#define SYS_GPA_MFPH_PA14MFP_TM2_CNT          (0x05UL<<SYS_GPA_MFPH_PA14MFP_Pos) /*!< Timer2 event counter input. */
#define SYS_GPA_MFPH_PA14MFP_UART0_RXD        (0x06UL<<SYS_GPA_MFPH_PA14MFP_Pos) /*!< Data receiver input pin for UART0. */
#define SYS_GPA_MFPH_PA14MFP_TM2_OUT          (0x07UL<<SYS_GPA_MFPH_PA14MFP_Pos) /*!< Timer2 toggle output. */
#define SYS_GPA_MFPH_PA15MFP_GPIO             (0x00UL<<SYS_GPA_MFPH_PA15MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPA_MFPH_PA15MFP_PWM0_CH3         (0x01UL<<SYS_GPA_MFPH_PA15MFP_Pos) /*!< PWM0 channel3 output/capture input. */
#define SYS_GPA_MFPH_PA15MFP_I2C1_SCL         (0x02UL<<SYS_GPA_MFPH_PA15MFP_Pos) /*!< I2C1 clock pin. */
#define SYS_GPA_MFPH_PA15MFP_TM3_EXT          (0x03UL<<SYS_GPA_MFPH_PA15MFP_Pos) /*!< Timer3 external capture input. */
#define SYS_GPA_MFPH_PA15MFP_SC0_PWR          (0x04UL<<SYS_GPA_MFPH_PA15MFP_Pos) /*!< SmartCard0 power pin. */
#define SYS_GPA_MFPH_PA15MFP_TM3_CNT          (0x05UL<<SYS_GPA_MFPH_PA15MFP_Pos) /*!< Timer3 event counter input. */
#define SYS_GPA_MFPH_PA15MFP_UART0_TXD        (0x06UL<<SYS_GPA_MFPH_PA15MFP_Pos) /*!< Data transmitter output pin for UART0. */
#define SYS_GPA_MFPH_PA15MFP_TM3_OUT          (0x07UL<<SYS_GPA_MFPH_PA15MFP_Pos) /*!< Timer3 toggle output. */
/********************* Bit definition of GPB_MFPL register **********************/
#define SYS_GPB_MFPL_PB0MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB0MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPL_PB0MFP_UART0_RXD         (0x01UL<<SYS_GPB_MFPL_PB0MFP_Pos) /*!< Data receiver input pin for UART0. */
#define SYS_GPB_MFPL_PB0MFP_SPI1_MOSI0        (0x03UL<<SYS_GPB_MFPL_PB0MFP_Pos) /*!< 1st SPI1 MOSI (Master Out, Slave In) pin. */
#define SYS_GPB_MFPL_PB1MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB1MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPL_PB1MFP_UART0_TXD         (0x01UL<<SYS_GPB_MFPL_PB1MFP_Pos) /*!< Data transmitter output pin for UART0. */
#define SYS_GPB_MFPL_PB1MFP_SPI1_MISO0        (0x03UL<<SYS_GPB_MFPL_PB1MFP_Pos) /*!< 1st SPI1 MISO (Master In, Slave Out) pin. */
#define SYS_GPB_MFPL_PB2MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPL_PB2MFP_UART0_nRTS        (0x01UL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< Request to Send output pin for UART0. */
#define SYS_GPB_MFPL_PB2MFP_SPI1_CLK          (0x03UL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< SPI1 serial clock pin. */
#define SYS_GPB_MFPL_PB2MFP_CLKO              (0x04UL<<SYS_GPB_MFPL_PB2MFP_Pos) /*!< Output selected clock. */
#define SYS_GPB_MFPL_PB3MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPL_PB3MFP_UART0_nCTS        (0x01UL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< Clear to Send input pin for UART0. */
#define SYS_GPB_MFPL_PB3MFP_SPI1_SS0          (0x03UL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< 1st SPI1 slave select pin. */
#define SYS_GPB_MFPL_PB3MFP_SC1_CD            (0x04UL<<SYS_GPB_MFPL_PB3MFP_Pos) /*!< SmartCard1 card detect pin. */
#define SYS_GPB_MFPL_PB4MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPL_PB4MFP_UART1_RXD         (0x01UL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< Data receiver input pin for UART1. */
#define SYS_GPB_MFPL_PB4MFP_SC0_CD            (0x03UL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< SmartCard0 card detect pin. */
#define SYS_GPB_MFPL_PB4MFP_SPI2_SS0          (0x04UL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< 1st SPI2 slave select pin. */
#define SYS_GPB_MFPL_PB4MFP_RTC_HZ            (0x06UL<<SYS_GPB_MFPL_PB4MFP_Pos) /*!< RTC output 1Hz pin. */
#define SYS_GPB_MFPL_PB5MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPL_PB5MFP_UART1_TXD         (0x01UL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< Data transmitter output pin for UART1. */
#define SYS_GPB_MFPL_PB5MFP_SC0_RST           (0x03UL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< SmartCard0 reset pin. */
#define SYS_GPB_MFPL_PB5MFP_SPI2_CLK          (0x04UL<<SYS_GPB_MFPL_PB5MFP_Pos) /*!< SPI2 serial clock pin. */
#define SYS_GPB_MFPL_PB6MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB6MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPL_PB6MFP_UART1_nRTS        (0x01UL<<SYS_GPB_MFPL_PB6MFP_Pos) /*!< Request to Send output pin for UART1. */
#define SYS_GPB_MFPL_PB6MFP_SPI2_MISO0        (0x04UL<<SYS_GPB_MFPL_PB6MFP_Pos) /*!< 1st SPI2 MISO (Master In, Slave Out) pin. */
#define SYS_GPB_MFPL_PB7MFP_GPIO              (0x00UL<<SYS_GPB_MFPL_PB7MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPL_PB7MFP_UART1_nCTS        (0x01UL<<SYS_GPB_MFPL_PB7MFP_Pos) /*!< Clear to Send input pin for UART1. */
#define SYS_GPB_MFPL_PB7MFP_SPI2_MOSI0        (0x04UL<<SYS_GPB_MFPL_PB7MFP_Pos) /*!< 1st SPI2 MOSI (Master Out, Slave In) pin. */
/********************* Bit definition of GPB_MFPH register **********************/
#define SYS_GPB_MFPH_PB8MFP_GPIO              (0x00UL<<SYS_GPB_MFPH_PB8MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPH_PB8MFP_STADC             (0x01UL<<SYS_GPB_MFPH_PB8MFP_Pos) /*!< ADC external trigger input. */
#define SYS_GPB_MFPH_PB8MFP_TM0_CNT           (0x02UL<<SYS_GPB_MFPH_PB8MFP_Pos) /*!< Timer0 event counter input. */
#define SYS_GPB_MFPH_PB8MFP_INT0              (0x03UL<<SYS_GPB_MFPH_PB8MFP_Pos) /*!< External interrupt0 input pin. */
#define SYS_GPB_MFPH_PB8MFP_TM0_OUT           (0x04UL<<SYS_GPB_MFPH_PB8MFP_Pos) /*!< Timer0 toggle output. */
#define SYS_GPB_MFPH_PB8MFP_SNOOPER           (0x07UL<<SYS_GPB_MFPH_PB8MFP_Pos) /*!< Snooper pin. */
#define SYS_GPB_MFPH_PB9MFP_GPIO              (0x00UL<<SYS_GPB_MFPH_PB9MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPH_PB9MFP_SPI1_SS1          (0x01UL<<SYS_GPB_MFPH_PB9MFP_Pos) /*!< 1st SPI1 slave select pin. */
#define SYS_GPB_MFPH_PB9MFP_TM1_CNT           (0x02UL<<SYS_GPB_MFPH_PB9MFP_Pos) /*!< Timer1 event counter input. */
#define SYS_GPB_MFPH_PB9MFP_TM1_OUT           (0x04UL<<SYS_GPB_MFPH_PB9MFP_Pos) /*!< Timer1 toggle output. */
#define SYS_GPB_MFPH_PB9MFP_INT0              (0x05UL<<SYS_GPB_MFPH_PB9MFP_Pos) /*!< External interrupt0 input pin. */
#define SYS_GPB_MFPH_PB10MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB10MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPH_PB10MFP_SPI0_MOSI0       (0x01UL<<SYS_GPB_MFPH_PB10MFP_Pos) /*!< 1st SPI0 MOSI (Master Out, Slave In) pin. */
#define SYS_GPB_MFPH_PB10MFP_TM2_CNT          (0x02UL<<SYS_GPB_MFPH_PB10MFP_Pos) /*!< Timer2 event counter input. */
#define SYS_GPB_MFPH_PB10MFP_TM2_OUT          (0x04UL<<SYS_GPB_MFPH_PB10MFP_Pos) /*!< Timer2 toggle output. */
#define SYS_GPB_MFPH_PB10MFP_SPI0_SS1         (0x05UL<<SYS_GPB_MFPH_PB10MFP_Pos) /*!< 1st SPI0 slave select pin. */
#define SYS_GPB_MFPH_PB11MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB11MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPH_PB11MFP_PWM0_CH4         (0x01UL<<SYS_GPB_MFPH_PB11MFP_Pos) /*!< PWM0 channel4 output/capture input. */
#define SYS_GPB_MFPH_PB11MFP_TM3_CNT          (0x02UL<<SYS_GPB_MFPH_PB11MFP_Pos) /*!< Timer3 event counter input. */
#define SYS_GPB_MFPH_PB11MFP_TM3_OUT          (0x04UL<<SYS_GPB_MFPH_PB11MFP_Pos) /*!< Timer3 toggle output. */
#define SYS_GPB_MFPH_PB11MFP_SPI0_MISO0       (0x05UL<<SYS_GPB_MFPH_PB11MFP_Pos) /*!< 1st SPI0 MISO (Master In, Slave Out) pin. */
#define SYS_GPB_MFPH_PB13MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB13MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPH_PB13MFP_SPI2_MISO1       (0x03UL<<SYS_GPB_MFPH_PB13MFP_Pos) /*!< 2nd SPI2 MISO (Master In, Slave Out) pin. */
#define SYS_GPB_MFPH_PB13MFP_SNOOPER          (0x07UL<<SYS_GPB_MFPH_PB13MFP_Pos) /*!< Snooper pin. */
#define SYS_GPB_MFPH_PB14MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB14MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPH_PB14MFP_INT0             (0x01UL<<SYS_GPB_MFPH_PB14MFP_Pos) /*!< External interrupt0 input pin. */
#define SYS_GPB_MFPH_PB14MFP_SPI2_MOSI1       (0x03UL<<SYS_GPB_MFPH_PB14MFP_Pos) /*!< 2nd SPI2 MOSI (Master Out, Slave In) pin. */
#define SYS_GPB_MFPH_PB14MFP_SPI2_SS1         (0x04UL<<SYS_GPB_MFPH_PB14MFP_Pos) /*!< 1st SPI2 slave select pin. */
#define SYS_GPB_MFPH_PB15MFP_GPIO             (0x00UL<<SYS_GPB_MFPH_PB15MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPB_MFPH_PB15MFP_INT1             (0x01UL<<SYS_GPB_MFPH_PB15MFP_Pos) /*!< External interrupt1 input pin. */
#define SYS_GPB_MFPH_PB15MFP_SNOOPER          (0x03UL<<SYS_GPB_MFPH_PB15MFP_Pos) /*!< Snooper pin. */
#define SYS_GPB_MFPH_PB15MFP_SC1_CD           (0x04UL<<SYS_GPB_MFPH_PB15MFP_Pos) /*!< SmartCard1 card detect pin. */
/********************* Bit definition of GPC_MFPL register **********************/
#define SYS_GPC_MFPL_PC0MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC0MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPL_PC0MFP_SPI0_SS0          (0x01UL<<SYS_GPC_MFPL_PC0MFP_Pos) /*!< 1st SPI0 slave select pin. */
#define SYS_GPC_MFPL_PC0MFP_SC1_CLK           (0x04UL<<SYS_GPC_MFPL_PC0MFP_Pos) /*!< SmartCard1 clock pin. */
#define SYS_GPC_MFPL_PC0MFP_PWM0_BRAKE1       (0x05UL<<SYS_GPC_MFPL_PC0MFP_Pos) /*!< Brake input pin 1 of PWM0. */
#define SYS_GPC_MFPL_PC1MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC1MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPL_PC1MFP_SPI0_CLK          (0x01UL<<SYS_GPC_MFPL_PC1MFP_Pos) /*!< SPI0 serial clock pin. */
#define SYS_GPC_MFPL_PC1MFP_SC1_DAT           (0x04UL<<SYS_GPC_MFPL_PC1MFP_Pos) /*!< SmartCard1 data pin. */
#define SYS_GPC_MFPL_PC1MFP_PWM0_BRAKE0       (0x05UL<<SYS_GPC_MFPL_PC1MFP_Pos) /*!< Brake input pin 1 of PWM0. */
#define SYS_GPC_MFPL_PC2MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC2MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPL_PC2MFP_SPI0_MISO0        (0x01UL<<SYS_GPC_MFPL_PC2MFP_Pos) /*!< 1st SPI0 MISO (Master In, Slave Out) pin. */
#define SYS_GPC_MFPL_PC2MFP_SC1_PWR           (0x04UL<<SYS_GPC_MFPL_PC2MFP_Pos) /*!< SmartCard1 power pin. */
#define SYS_GPC_MFPL_PC2MFP_PWM0_BRAKE1       (0x05UL<<SYS_GPC_MFPL_PC2MFP_Pos) /*!< Brake input pin 0 of PWM0. */
#define SYS_GPC_MFPL_PC3MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC3MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPL_PC3MFP_SPI0_MOSI0        (0x01UL<<SYS_GPC_MFPL_PC3MFP_Pos) /*!< 1st SPI0 MOSI (Master Out, Slave In) pin. */
#define SYS_GPC_MFPL_PC3MFP_SC1_RST           (0x04UL<<SYS_GPC_MFPL_PC3MFP_Pos) /*!< SmartCard1 reset pin. */
#define SYS_GPC_MFPL_PC3MFP_PWM0_BRAKE0       (0x05UL<<SYS_GPC_MFPL_PC3MFP_Pos) /*!< Brake input pin 0 of PWM0. */
#define SYS_GPC_MFPL_PC6MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC6MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPL_PC6MFP_UART1_RXD         (0x01UL<<SYS_GPC_MFPL_PC6MFP_Pos) /*!< Data receiver input pin for UART1. */
#define SYS_GPC_MFPL_PC6MFP_TM0_EXT           (0x03UL<<SYS_GPC_MFPL_PC6MFP_Pos) /*!< Timer0 external capture input. */
#define SYS_GPC_MFPL_PC6MFP_SC1_CD            (0x04UL<<SYS_GPC_MFPL_PC6MFP_Pos) /*!< SmartCard1 card detect pin. */
#define SYS_GPC_MFPL_PC6MFP_PWM0_CH0          (0x05UL<<SYS_GPC_MFPL_PC6MFP_Pos) /*!< PWM0 channel0 output/capture input. */
#define SYS_GPC_MFPL_PC7MFP_GPIO              (0x00UL<<SYS_GPC_MFPL_PC7MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPL_PC7MFP_UART1_TXD         (0x01UL<<SYS_GPC_MFPL_PC7MFP_Pos) /*!< Data transmitter output pin for UART1. */
#define SYS_GPC_MFPL_PC7MFP_ADC_CH7           (0x02UL<<SYS_GPC_MFPL_PC7MFP_Pos) /*!< ADC channel7 analog input. */
#define SYS_GPC_MFPL_PC7MFP_TM1_EXT           (0x03UL<<SYS_GPC_MFPL_PC7MFP_Pos) /*!< Timer1 external capture input. */
#define SYS_GPC_MFPL_PC7MFP_PWM0_CH1          (0x05UL<<SYS_GPC_MFPL_PC7MFP_Pos) /*!< PWM0 channel1 output/capture input. */
/********************* Bit definition of GPC_MFPH register **********************/
#define SYS_GPC_MFPH_PC8MFP_GPIO              (0x00UL<<SYS_GPC_MFPH_PC8MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPH_PC8MFP_SPI1_SS0          (0x01UL<<SYS_GPC_MFPH_PC8MFP_Pos) /*!< 1st SPI1 slave select pin. */
#define SYS_GPC_MFPH_PC8MFP_I2C1_SDA          (0x05UL<<SYS_GPC_MFPH_PC8MFP_Pos) /*!< I2C1 data input/output pin. */
#define SYS_GPC_MFPH_PC9MFP_GPIO              (0x00UL<<SYS_GPC_MFPH_PC9MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPH_PC9MFP_SPI1_CLK          (0x01UL<<SYS_GPC_MFPH_PC9MFP_Pos) /*!< SPI1 serial clock pin. */
#define SYS_GPC_MFPH_PC9MFP_I2C1_SCL          (0x05UL<<SYS_GPC_MFPH_PC9MFP_Pos) /*!< I2C1 clock pin. */
#define SYS_GPC_MFPH_PC10MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC10MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPH_PC10MFP_SPI1_MISO0       (0x01UL<<SYS_GPC_MFPH_PC10MFP_Pos) /*!< 1st SPI1 MISO (Master In, Slave Out) pin. */
#define SYS_GPC_MFPH_PC10MFP_UART1_RXD        (0x05UL<<SYS_GPC_MFPH_PC10MFP_Pos) /*!< Data receiver input pin for UART1. */
#define SYS_GPC_MFPH_PC11MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC11MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPH_PC11MFP_SPI1_MOSI0       (0x01UL<<SYS_GPC_MFPH_PC11MFP_Pos) /*!< 1st SPI1 MOSI (Master Out, Slave In) pin. */
#define SYS_GPC_MFPH_PC11MFP_UART1_TXD        (0x05UL<<SYS_GPC_MFPH_PC11MFP_Pos) /*!< Data transmitter output pin for UART1. */
#define SYS_GPC_MFPH_PC14MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC14MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPH_PC14MFP_UART1_nCTS       (0x01UL<<SYS_GPC_MFPH_PC14MFP_Pos) /*!< Clear to Send input pin for UART1. */
#define SYS_GPC_MFPH_PC15MFP_GPIO             (0x00UL<<SYS_GPC_MFPH_PC15MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPC_MFPH_PC15MFP_UART1_nRTS       (0x01UL<<SYS_GPC_MFPH_PC15MFP_Pos) /*!< Request to Send output pin for UART1. */
#define SYS_GPC_MFPH_PC15MFP_TM0_EXT          (0x03UL<<SYS_GPC_MFPH_PC15MFP_Pos) /*!< Timer0 external capture input. */
/********************* Bit definition of GPD_MFPL register **********************/
#define SYS_GPD_MFPL_PD6MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD6MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPD_MFPL_PD6MFP_SPI1_MOSI1        (0x03UL<<SYS_GPD_MFPL_PD6MFP_Pos) /*!< 2nd SPI1 MOSI (Master Out, Slave In) pin. */
