OpenNuvoton/NuTool-PinConfigure/Header/NANO103/sys.h
#define SYS_GPD_MFPL_PD6MFP_SC1_RST           (0x04UL<<SYS_GPD_MFPL_PD6MFP_Pos) /*!< SmartCard1 reset pin. */
#define SYS_GPD_MFPL_PD7MFP_GPIO              (0x00UL<<SYS_GPD_MFPL_PD7MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPD_MFPL_PD7MFP_SPI1_MISO1        (0x03UL<<SYS_GPD_MFPL_PD7MFP_Pos) /*!< 2nd SPI1 MISO (Master In, Slave Out) pin. */
#define SYS_GPD_MFPL_PD7MFP_SC1_PWR           (0x04UL<<SYS_GPD_MFPL_PD7MFP_Pos) /*!< SmartCard1 power pin. */
/********************* Bit definition of GPD_MFPH register **********************/
#define SYS_GPD_MFPH_PD14MFP_GPIO             (0x00UL<<SYS_GPD_MFPH_PD14MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPD_MFPH_PD14MFP_SPI0_MOSI1       (0x01UL<<SYS_GPD_MFPH_PD14MFP_Pos) /*!< 2nd SPI0 MOSI (Master Out, Slave In) pin. */
#define SYS_GPD_MFPH_PD14MFP_SC1_DAT          (0x04UL<<SYS_GPD_MFPH_PD14MFP_Pos) /*!< SmartCard1 data pin. */
#define SYS_GPD_MFPH_PD15MFP_GPIO             (0x00UL<<SYS_GPD_MFPH_PD15MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPD_MFPH_PD15MFP_SPI0_MISO1       (0x01UL<<SYS_GPD_MFPH_PD15MFP_Pos) /*!< 2nd SPI0 MISO (Master In, Slave Out) pin. */
#define SYS_GPD_MFPH_PD15MFP_SC1_CLK          (0x04UL<<SYS_GPD_MFPH_PD15MFP_Pos) /*!< SmartCard1 clock pin. */
/********************* Bit definition of GPE_MFPL register **********************/
#define SYS_GPE_MFPL_PE5MFP_GPIO              (0x00UL<<SYS_GPE_MFPL_PE5MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPE_MFPL_PE5MFP_PWM0_CH5          (0x01UL<<SYS_GPE_MFPL_PE5MFP_Pos) /*!< PWM0 channel5 output/capture input. */
#define SYS_GPE_MFPL_PE5MFP_RTC_HZ            (0x06UL<<SYS_GPE_MFPL_PE5MFP_Pos) /*!< RTC output 1Hz pin. */
/********************* Bit definition of GPF_MFPL register **********************/
#define SYS_GPF_MFPL_PF0MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF0MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPF_MFPL_PF0MFP_INT0              (0x05UL<<SYS_GPF_MFPL_PF0MFP_Pos) /*!< External interrupt0 input pin. */
#define SYS_GPF_MFPL_PF0MFP_ICE_DAT           (0x07UL<<SYS_GPF_MFPL_PF0MFP_Pos) /*!< Serial wired debugger data pin. */
#define SYS_GPF_MFPL_PF1MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPF_MFPL_PF1MFP_CLKO              (0x04UL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< Output selected clock. */
#define SYS_GPF_MFPL_PF1MFP_INT1              (0x05UL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< External interrupt1 input pin. */
#define SYS_GPF_MFPL_PF1MFP_ICE_CLK           (0x07UL<<SYS_GPF_MFPL_PF1MFP_Pos) /*!< Serial wired debugger clock pin. */
#define SYS_GPF_MFPL_PF2MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF2MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPF_MFPL_PF2MFP_XT1_OUT           (0x07UL<<SYS_GPF_MFPL_PF2MFP_Pos) /*!< External 4~24 MHz (high speed) crystal output pin. */
#define SYS_GPF_MFPL_PF3MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF3MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPF_MFPL_PF3MFP_XT1_IN            (0x07UL<<SYS_GPF_MFPL_PF3MFP_Pos) /*!< External 4~24 MHz (high speed) crystal input pin. */
#define SYS_GPF_MFPL_PF6MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF6MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPF_MFPL_PF6MFP_I2C1_SDA          (0x01UL<<SYS_GPF_MFPL_PF6MFP_Pos) /*!< I2C1 data input/output pin. */
#define SYS_GPF_MFPL_PF6MFP_X32_OUT           (0x07UL<<SYS_GPF_MFPL_PF6MFP_Pos) /*!< External 32.768 kHz (low speed) crystal output pin. */
#define SYS_GPF_MFPL_PF7MFP_GPIO              (0x00UL<<SYS_GPF_MFPL_PF7MFP_Pos) /*!< General purpose digital I/O pin. */
#define SYS_GPF_MFPL_PF7MFP_I2C1_SCL          (0x01UL<<SYS_GPF_MFPL_PF7MFP_Pos) /*!< I2C1 clock pin. */
#define SYS_GPF_MFPL_PF7MFP_SC0_CD            (0x03UL<<SYS_GPF_MFPL_PF7MFP_Pos) /*!< SmartCard0 card detect pin. */
#define SYS_GPF_MFPL_PF7MFP_X32_IN            (0x07UL<<SYS_GPF_MFPL_PF7MFP_Pos) /*!< External 32.768 kHz (low speed) crystal input pin. */

/*@}*/ /* end of group NANO103_SYS_EXPORTED_CONSTANTS */

/** @addtogroup NANO103_SYS_EXPORTED_FUNCTIONS SYS Exported Functions
  @{
*/
/**
  * @brief      Clear Brown-out detector interrupt flag
  * @param      None
  * @return     None
  * @details    This macro clear Brown-out detector interrupt flag.
  */
#define SYS_CLEAR_BOD_INT_FLAG()        (SYS->BODCTL |= SYS_BODCTL_BODIF_Msk)

/**
  * @brief      Get Brown-out detector interrupt flag
  * @param      None
  * @retval     0   Brown-out detect interrupt flag is not set.
  * @retval     >=1 Brown-out detect interrupt flag is set.
  * @details    This macro get Brown-out detector interrupt flag.
  */
#define SYS_GET_BOD_INT_FLAG()          (SYS->BODCTL & SYS_BODCTL_BODIF_Msk)

/**
  * @brief      Enable Brown-out detector function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detector function.
  */
#define SYS_ENABLE_BOD()              (SYS->BODCTL |= SYS_BODCTL_BODEN_Msk)

/**
  * @brief      Disable Brown-out detector function
  * @param      None
  * @return     None
  * @details    This macro disable Brown-out detector function.
  */
#define SYS_DISABLE_BOD()             (SYS->BODCTL &= ~SYS_BODCTL_BODEN_Msk)

/**
  * @brief      Enable Low Power Brown-out detector function
  * @param      None
  * @return     None
  * @details    This macro enable Low Power Brown-out detector function.
  */
#define SYS_ENABLE_LPBOD()              (SYS->BODCTL |= SYS_BODCTL_LPBODEN_Msk)

/**
  * @brief      Disable Low Power Brown-out detector function
  * @param      None
  * @return     None
  * @details    This macro disable Low Power Brown-out detector function.
  */
#define SYS_DISABLE_LPBOD()             (SYS->BODCTL &= ~SYS_BODCTL_LPBODEN_Msk)

/**
  * @brief      Get Brown-out detector status
  * @param      None
  * @retval     0   System voltage is higher than BOD threshold voltage setting or BOD function is disabled.
  * @retval     >=1 System voltage is lower than BOD threshold voltage setting.
  * @details    This macro get Brown-out detector output status.
  *             If the BOD function is disabled, this function always return 0.
  */
#define SYS_GET_BOD_OUTPUT()            (SYS->BODCTL & SYS_BODCTL_BODOUT_Msk)

/**
  * @brief      Disable Brown-out detector reset function
  * @param      None
  * @return     None
  * @details    This macro disable Brown-out detector reset function.
  */
#define SYS_DISABLE_BOD_RST()         (SYS->BODCTL &= ~SYS_BODCTL_BODREN_Msk)

/**
  * @brief      Enable Brown-out detector reset function
  * @param      None
  * @return     None
  * @details    This macro enable Brown-out detect reset function.
  */
#define SYS_ENABLE_BOD_RST()          (SYS->BODCTL |= SYS_BODCTL_BODREN_Msk)

/**
  * @brief      Disable Low Power Brown-out detector reset function
  * @param      None
  * @return     None
  * @details    This macro disable Low Power Brown-out detector reset function.
  */
#define SYS_DISABLE_LPBOD_RST()         (SYS->BODCTL &= ~SYS_BODCTL_LPBODREN_Msk)

/**
  * @brief      Enable Low Power Brown-out detector reset function
  * @param      None
  * @return     None
  * @details    This macro enable Low Power Brown-out detect reset function.
  */
#define SYS_ENABLE_LPBOD_RST()          (SYS->BODCTL |= SYS_BODCTL_LPBODREN_Msk)

/**
  * @brief      Set Brown-out detector voltage level
  * @param[in]  u32Level is Brown-out voltage level. Including :
  *             - \ref SYS_BODCTL_BODVL_1_7V
  *             - \ref SYS_BODCTL_BODVL_1_8V
  *             - \ref SYS_BODCTL_BODVL_1_9V
  *             - \ref SYS_BODCTL_BODVL_2_0V
  *             - \ref SYS_BODCTL_BODVL_2_1V
  *             - \ref SYS_BODCTL_BODVL_2_2V
  *             - \ref SYS_BODCTL_BODVL_2_3V
  *             - \ref SYS_BODCTL_BODVL_2_4V
  *             - \ref SYS_BODCTL_BODVL_2_5V
  *             - \ref SYS_BODCTL_BODVL_2_6V
  *             - \ref SYS_BODCTL_BODVL_2_7V
  *             - \ref SYS_BODCTL_BODVL_2_8V
  *             - \ref SYS_BODCTL_BODVL_2_9V
  *             - \ref SYS_BODCTL_BODVL_3_0V
  *             - \ref SYS_BODCTL_BODVL_3_1V
  * @return     None
  * @details    This macro set Brown-out detector voltage level.
  *             The write-protection function should be disabled before using this macro.
  */
#define SYS_SET_BOD_LEVEL(u32Level)     (SYS->BODCTL = (SYS->BODCTL & ~SYS_BODCTL_BODVL_Msk) | (u32Level))

/**
  * @brief      Get reset source is from Brown-out detector reset
  * @param      None
  * @retval     0   Previous reset source is not from Brown-out detector reset
  * @retval     >=1 Previous reset source is from Brown-out detector reset
  * @details    This macro get previous reset source is from Brown-out detect reset or not.
  */
#define SYS_IS_BOD_RST()                (SYS->RSTSTS & SYS_RSTSTS_BODRF_Msk)

/**
  * @brief      Get reset source is from Low-voltage reset
  * @param      None
  * @retval     0   Previous reset source is not from Low-voltage reset
  * @retval     >=1 Previous reset source is from Low-voltage reset
  * @details    This macro get previous reset source is from Low-voltage reset or not.
  */
#define SYS_IS_LVR_RST()                (SYS->RSTSTS & SYS_RSTSTS_LVRF_Msk)

/**
  * @brief      Get reset source is from CPU reset
  * @param      None
  * @retval     0   Previous reset source is not from CPU reset
  * @retval     >=1 Previous reset source is from CPU reset
  * @details    This macro get previous reset source is from CPU reset.
  */
#define SYS_IS_CPU_RST()                (SYS->RSTSTS & SYS_RSTSTS_CPURF_Msk)


/**
  * @brief      Get reset source is from Cortex-M0 lockup event.
  * @param      None
  * @retval     0   Previous reset source is not from Cortex-M0 lockup event
  * @retval     >=1 Previous reset source is from Cortex-M0 lockup event
  * @details    This macro get previous reset source is from Cortex-M0 lockup event.
  */
#define SYS_IS_LOCKUP_RST()             (SYS->RSTSTS & SYS_RSTSTS_LOCKRF_Msk)

/**
  * @brief      Get reset source is from Power-on Reset
  * @param      None
  * @retval     0   Previous reset source is not from Power-on Reset
  * @retval     >=1 Previous reset source is from Power-on Reset
  * @details    This macro get previous reset source is from Power-on Reset.
  */
#define SYS_IS_POR_RST()                (SYS->RSTSTS & SYS_RSTSTS_PORF_Msk)

/**
  * @brief      Get reset source is from reset pin reset
  * @param      None
  * @retval     0   Previous reset source is not from reset pin reset
  * @retval     >=1 Previous reset source is from reset pin reset
  * @details    This macro get previous reset source is from reset pin reset.
  */
#define SYS_IS_RSTPIN_RST()             (SYS->RSTSTS & SYS_RSTSTS_PINRF_Msk)

/**
  * @brief      Get reset source is from system reset
  * @param      None
  * @retval     0   Previous reset source is not from system reset
  * @retval     >=1 Previous reset source is from system reset
  * @details    This macro get previous reset source is from system reset.
  */
#define SYS_IS_SYSTEM_RST()             (SYS->RSTSTS & SYS_RSTSTS_SYSRF_Msk)


/**
  * @brief      Get reset source is from window watch dog reset
  * @param      None
  * @retval     0   Previous reset source is not from window watch dog reset
  * @retval     >=1 Previous reset source is from window watch dog reset
  * @details    This macro get previous reset source is from window watch dog reset.
  */
#define SYS_IS_WDT_RST()                (SYS->RSTSTS & SYS_RSTSTS_WDTRF_Msk)

/**
  * @brief      Disable Low-Voltage-Reset function
  * @param      None
  * @return     None
  * @details    This macro disable Low-Voltage-Reset function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_DISABLE_LVR()               (SYS->BODCTL &= ~SYS_BODCTL_LVREN_Msk)

/**
  * @brief      Enable Low-Voltage-Reset function
  * @param      None
  * @return     None
  * @details    This macro enable Low-Voltage-Reset function.
  *             The register write-protection function should be disabled before using this macro.
  */
#define SYS_ENABLE_LVR()                (SYS->BODCTL |= SYS_BODCTL_LVREN_Msk)

/**
  * @brief      Disable Power-on Reset function
  * @param      None
  * @return     None
  * @details    This macro disable Power-on Reset function.
  */
#define SYS_DISABLE_POR()               do{SYS->PORCTL = 0x5AA5;SYS->MISCCTL = SYS_MISCCTL_POR33DIS_Msk | SYS_MISCCTL_POR18DIS_Msk;}while(0)

/**
  * @brief      Enable Power-on Reset function
  * @param      None
  * @return     None
  * @details    This macro enable Power-on Reset function.
  */
#define SYS_ENABLE_POR()                do{SYS->PORCTL = 0;SYS->MISCCTL = 0;}while(0)

/**
  * @brief      Clear reset source flag
  * @param[in]  u32RstSrc is reset source. Including:
  *             - \ref SYS_RSTSTS_PORF_Msk
  *             - \ref SYS_RSTSTS_PINRF_Msk
  *             - \ref SYS_RSTSTS_WDTRF_Msk
    *             - \ref SYS_RSTSTS_LVRF_Msk
  *             - \ref SYS_RSTSTS_BODRF_Msk
  *             - \ref SYS_RSTSTS_SYSRF_Msk
  *             - \ref SYS_RSTSTS_CPURF_Msk
  *             - \ref SYS_RSTSTS_LOCKRF_Msk
  * @return     None
  * @details    This macro clear reset source flag.
  */
#define SYS_CLEAR_RST_SOURCE(u32RstSrc) (SYS->RSTSTS |= u32RstSrc)

/**
  * @brief      Disable register write-protection function
  * @param      None
  * @return     None
  * @details    This function disable register write-protection function.
  *             To unlock the protected register to allow write access.
  */
__STATIC_INLINE void SYS_UnlockReg(void)
{
    while(SYS->REGLCTL != SYS_REGLCTL_REGLCTL_Msk)
    {
        SYS->REGLCTL = 0x59;
        SYS->REGLCTL = 0x16;
        SYS->REGLCTL = 0x88;
    }
}

/**
  * @brief      Enable register write-protection function
  * @param      None
  * @return     None
  * @details    This function is used to enable register write-protection function.
  *             To lock the protected register to forbid write access.
  */
__STATIC_INLINE void SYS_LockReg(void)
{
    SYS->REGLCTL = 0;
}

/**
  * @brief      Get HIRC0 trim status
  * @param      None
  * @retval     BIT0 HIRC0 Frequency Lock
  * @retval     BIT1 Trim Failure Interrupt
  * @retval     BIT2 LXT Clock error
  * @details    This macro get HIRC0 trim interrupt status register.
  */
#define SYS_GET_IRC0TRIM_INT_FLAG()          (SYS->IRC0TISTS)

/**
  * @brief      Clear HIRC0 trim flag
  * @param[in]  u32IRCTrimFlg is HIRC0 trim flags. Including:
  *             - \ref SYS_IRCTISTS_FAIL_INT
  *             - \ref SYS_IRCTISTS_32KERR_INT
  * @return     None
  * @details    This macro clear HIRC0 trim flag.
  */
#define SYS_CLEAR_IRC0TRIM_INT_FLAG(u32IRCTrimFlg)          (SYS->IRC0TISTS = u32IRCTrimFlg)

/**
  * @brief      Get HIRC1 trim status
  * @param      None
  * @retval     BIT0 HIRC1 Frequency Lock
  * @retval     BIT1 Trim Failure Interrupt
  * @retval     BIT2 LXT Clock error
  * @details    This macro get HIRC1 trim interrupt status register.
  */
#define SYS_GET_IRC1TRIM_INT_FLAG()          (SYS->IRC1TISTS)

/**
  * @brief      Clear HIRC1 trim flag
  * @param[in]  u32IRCTrimFlg is HIRC1 trim flags. Including:
  *             - \ref SYS_IRCTISTS_FAIL_INT
  *             - \ref SYS_IRCTISTS_32KERR_INT
  * @return     None
  * @details    This macro clear HIRC1 trim flag.
  */
#define SYS_CLEAR_IRC1TRIM_INT_FLAG(u32IRCTrimFlg)          (SYS->IRC1TISTS = u32IRCTrimFlg)

/**
  * @brief      Get MIRC trim status
  * @param      None
  * @retval     BIT0 MIRC Frequency Lock
  * @retval     BIT1 Trim Failure Interrupt
  * @retval     BIT2 LXT Clock error
  * @details    This macro get MIRC trim interrupt status register.
  */
#define SYS_GET_MIRCTRIM_INT_FLAG()          (SYS->MIRCTISTS)

/**
  * @brief      Clear MIRC trim flag
  * @param[in]  u32IRCTrimFlg is MIRC trim flags. Including:
  *             - \ref SYS_IRCTISTS_FAIL_INT
  *             - \ref SYS_IRCTISTS_32KERR_INT
  * @return     None
  * @details    This macro clear MIRC trim flag.
  */
#define SYS_CLEAR_MIRCTRIM_INT_FLAG(u32IRCTrimFlg)          (SYS->MIRCTISTS = u32IRCTrimFlg)

void SYS_ClearResetSrc(uint32_t u32Src);
uint32_t SYS_GetBODStatus(void);
uint32_t SYS_GetResetSrc(void);
uint32_t SYS_IsRegLocked(void);
void SYS_LockReg(void);
void SYS_UnlockReg(void);
uint32_t  SYS_ReadPDID(void);
void SYS_ResetChip(void);
void SYS_ResetCPU(void);
void SYS_ResetModule(uint32_t u32ModuleIndex);
void SYS_EnableBOD(int32_t i32Mode, uint32_t u32BODLevel);
void SYS_DisableBOD(void);
void SYS_EnableLPBOD(int32_t i32Mode, uint32_t u32BODLevel);
void SYS_DisableLPBOD(void);
void SYS_EnableHIRC0Trim(uint32_t u32TrimSel,uint32_t u32TrimEnInt);
void SYS_DisableHIRC0Trim(void);
void SYS_EnableHIRC1Trim(uint32_t u32TrimSel,uint32_t u32TrimEnInt);
void SYS_DisableHIRC1Trim(void);
void SYS_EnableMIRCTrim(uint32_t u32TrimSel,uint32_t u32TrimEnInt);
void SYS_DisableMIRCTrim(void);
/*@}*/ /* end of group NANO103_SYS_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NANO103_SYS_Driver */

/*@}*/ /* end of group NANO103_Device_Driver */

#ifdef __cplusplus
}
#endif

#endif //__SYS_H__

/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/